pressure-test/results/wrk2/stress-20260504T070109Z.txt
D:/Git/scripts/plan_list.lua: cannot open D:/Git/scripts/plan_list.lua: No such file or directory
D:/Git/scripts/plan_list.lua: cannot open D:/Git/scripts/plan_list.lua: No such file or directory
D:/Git/scripts/plan_list.lua: cannot open D:/Git/scripts/plan_list.lua: No such file or directory
[...]
Running 1m test @ http://host.docker.internal:20004
  4 threads and 128 connections
  Thread calibration: mean lat.: 2.406ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 169.944ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 85.307ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 348.850ms, rate sampling interval: 2670ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.32ms  302.41ms   5.07s    99.00%
    Req/Sec   519.59    174.15     3.00k    74.65%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.83ms
 75.000%    2.29ms
 90.000%    2.93ms
 99.000%  341.76ms
 99.900%    4.62s 
 99.990%    5.05s 
 99.999%    5.07s 
100.000%    5.07s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.465     0.000000            1         1.00
       1.183     0.100000         9875         1.11
       1.379     0.200000        19747         1.25
       1.546     0.300000        29639         1.43
       1.689     0.400000        39538         1.67
       1.831     0.500000        49391         2.00
       1.904     0.550000        54323         2.22
       1.982     0.600000        59260         2.50
       2.067     0.650000        64181         2.86
       2.167     0.700000        69116         3.33
       2.289     0.750000        74082         4.00
       2.357     0.775000        76530         4.44
       2.431     0.800000        79008         5.00
       2.513     0.825000        81456         5.71
       2.613     0.850000        83938         6.67
       2.743     0.875000        86389         8.00
       2.825     0.887500        87623         8.89
       2.929     0.900000        88852        10.00
       3.075     0.912500        90084        11.43
       3.257     0.925000        91318        13.33
       3.547     0.937500        92551        16.00
       3.751     0.943750        93168        17.78
       3.999     0.950000        93781        20.00
       4.319     0.956250        94402        22.86
       4.819     0.962500        95017        26.67
       5.483     0.968750        95632        32.00
       5.919     0.971875        95941        35.56
       6.523     0.975000        96251        40.00
       7.123     0.978125        96557        45.71
       8.187     0.981250        96869        53.33
      10.351     0.984375        97174        64.00
      12.967     0.985938        97328        71.11
      18.351     0.987500        97484        80.00
      47.423     0.989062        97637        91.43
     621.055     0.990625        97791       106.67
    1367.039     0.992188        97945       128.00
    1742.847     0.992969        98024       142.22
    2117.631     0.993750        98100       160.00
    2492.415     0.994531        98178       182.86
    2865.151     0.995313        98254       213.33
    3239.935     0.996094        98331       256.00
    3420.159     0.996484        98369       284.44
    3606.527     0.996875        98408       320.00
    3794.943     0.997266        98447       365.71
    3983.359     0.997656        98486       426.67
    4171.775     0.998047        98525       512.00
    4243.455     0.998242        98544       568.89
    4358.143     0.998437        98562       640.00
    4431.871     0.998633        98584       731.43
    4546.559     0.998828        98601       853.33
    4616.191     0.999023        98620      1024.00
    4677.631     0.999121        98632      1137.78
    4730.879     0.999219        98639      1280.00
    4747.263     0.999316        98649      1462.86
    4804.607     0.999414        98659      1706.67
    4866.047     0.999512        98672      2048.00
    4874.239     0.999561        98675      2275.56
    4919.295     0.999609        98678      2560.00
    4927.487     0.999658        98685      2925.71
    4935.679     0.999707        98688      3413.33
    4984.831     0.999756        98692      4096.00
    4988.927     0.999780        98697      4551.11
    4988.927     0.999805        98697      5120.00
    4997.119     0.999829        98701      5851.43
    5009.407     0.999854        98703      6826.67
    5042.175     0.999878        98704      8192.00
    5050.367     0.999890        98706      9102.22
    5054.463     0.999902        98711     10240.00
    5054.463     0.999915        98711     11702.86
    5054.463     0.999927        98711     13653.33
    5054.463     0.999939        98711     16384.00
    5054.463     0.999945        98711     18204.44
    5062.655     0.999951        98714     20480.00
    5062.655     0.999957        98714     23405.71
    5062.655     0.999963        98714     27306.67
    5062.655     0.999969        98714     32768.00
    5062.655     0.999973        98714     36408.89
    5062.655     0.999976        98714     40960.00
    5062.655     0.999979        98714     46811.43
    5070.847     0.999982        98715     54613.33
    5070.847     0.999985        98715     65536.00
    5070.847     0.999986        98715     72817.78
    5070.847     0.999988        98715     81920.00
    5070.847     0.999989        98715     93622.86
    5074.943     0.999991        98716    109226.67
    5074.943     1.000000        98716          inf
#[Mean    =       29.316, StdDeviation   =      302.406]
#[Max     =     5070.848, Total count    =        98716]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  118163 requests in 1.00m, 63.92MB read
  Socket errors: connect 0, read 0, write 0, timeout 79
  Non-2xx or 3xx responses: 118163
Requests/sec:   1969.27
Transfer/sec:      1.07MB