pressure-test/results/wrk2/stress-20260504T071020Z.txt
Running 1m test @ http://host.docker.internal:20004
  4 threads and 128 connections
  Thread calibration: mean lat.: 4197.728ms, rate sampling interval: 16285ms
  Thread calibration: mean lat.: 4324.409ms, rate sampling interval: 15425ms
  Thread calibration: mean lat.: 4376.820ms, rate sampling interval: 15933ms
  Thread calibration: mean lat.: 4387.615ms, rate sampling interval: 15998ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.82s    13.16s    0.94m    58.16%
    Req/Sec    43.33      0.85    45.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   31.88s 
 75.000%   43.09s 
 90.000%   49.87s 
 99.000%    0.91m 
 99.900%    0.93m 
 99.990%    0.93m 
 99.999%    0.94m 
100.000%    0.94m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8048.639     0.000000            1         1.00
   13533.183     0.100000          877         1.11
   18137.087     0.200000         1753         1.25
   22822.911     0.300000         2625         1.43
   27213.823     0.400000         3501         1.67
   31883.263     0.500000         4376         2.00
   34078.719     0.550000         4811         2.22
   36438.015     0.600000         5253         2.50
   38535.167     0.650000         5689         2.86
   40796.159     0.700000         6127         3.33
   43089.919     0.750000         6566         4.00
   44302.335     0.775000         6785         4.44
   45252.607     0.800000         6999         5.00
   46759.935     0.825000         7220         5.71
   47775.743     0.850000         7436         6.67
   48693.247     0.875000         7654         8.00
   49151.999     0.887500         7766         8.89
   49905.663     0.900000         7876        10.00
   50659.327     0.912500         7982        11.43
   51249.151     0.925000         8092        13.33
   51904.511     0.937500         8206        16.00
   52166.655     0.943750         8257        17.78
   52428.799     0.950000         8310        20.00
   52658.175     0.956250         8372        22.86
   52887.551     0.962500         8425        26.67
   53215.231     0.968750         8474        32.00
   53411.839     0.971875         8501        35.56
   53641.215     0.975000         8531        40.00
   53936.127     0.978125         8557        45.71
   54132.735     0.981250         8588        53.33
   54329.343     0.984375         8616        64.00
   54427.647     0.985938         8624        71.11
   54558.719     0.987500         8638        80.00
   54689.791     0.989062         8659        91.43
   54722.559     0.990625         8667       106.67
   54853.631     0.992188         8682       128.00
   54919.167     0.992969         8686       142.22
   55083.007     0.993750         8696       160.00
   55115.775     0.994531         8700       182.86
   55181.311     0.995313         8708       213.33
   55214.079     0.996094         8713       256.00
   55246.847     0.996484         8719       284.44
   55279.615     0.996875         8721       320.00
   55377.919     0.997266         8725       365.71
   55443.455     0.997656         8727       426.67
   55574.527     0.998047         8730       512.00
   55672.831     0.998242         8732       568.89
   55771.135     0.998437         8735       640.00
   55803.903     0.998633         8736       731.43
   55869.439     0.998828         8738       853.33
   55902.207     0.999023         8739      1024.00
   55934.975     0.999121         8740      1137.78
   55967.743     0.999219         8743      1280.00
   55967.743     0.999316         8743      1462.86
   55967.743     0.999414         8743      1706.67
   55967.743     0.999512         8743      2048.00
   56000.511     0.999561         8745      2275.56
   56000.511     0.999609         8745      2560.00
   56000.511     0.999658         8745      2925.71
   56000.511     0.999707         8745      3413.33
   56000.511     0.999756         8745      4096.00
   56066.047     0.999780         8746      4551.11
   56066.047     0.999805         8746      5120.00
   56066.047     0.999829         8746      5851.43
   56066.047     0.999854         8746      6826.67
   56066.047     0.999878         8746      8192.00
   56360.959     0.999890         8747      9102.22
   56360.959     1.000000         8747          inf
#[Mean    =    31819.470, StdDeviation   =    13161.856]
#[Max     =    56328.192, Total count    =         8747]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10583 requests in 1.00m, 2.17GB read
  Socket errors: connect 0, read 0, write 0, timeout 1156
Requests/sec:    176.21
Transfer/sec:     37.03MB

Requests/sec: 176.21
p50 latency: 31883.26ms
p95 latency: 52428.80ms
p99 latency: 54722.56ms
max latency: 56328.19ms